Repository: drygdryg/ds-password-changer
Catalog: locales/*/LC_MESSAGES/*.po
Languages: ru, uk

source: Error — please fill in the required form fields
ru: Ошибка — заполните требуемые поля формы
uk: Помилка — заповніть необхідні поля форми

source: Error: password confirmation does not match the password
ru: Ошибка: подтверждение пароля не совпадает с паролем
uk: Помилка: підтвердження пароля не відповідає паролю

source: Attempting to change password of the protected user {username}
ru: Попытка изменить пароль защищённого пользователя {username}
uk: Спроба змінити пароль захищеного користувача {username}

source: Error: the specified user is protected from changes
ru: Ошибка: указанный пользователь защищён от изменений
uk: Помилка: вказаний користувач захищений від змін

source: Unsuccessful attempt to change password for user {username}: {e}
ru: Неудачная попытка изменить пароль для пользователя {username}: {e}
uk: Невдала спроба змінити пароль для користувача {username}: {e}

source: Error: the user with the specified name was not found
ru: Ошибка: пользователь с указанным именем не найден
uk: Помилка: користувач із зазначеним ім'ям не знайден

source: Error: the user's credentials were revoked — make sure that the user is not blocked in the domain
ru: Ошибка: учётные данные пользователя были отозваны — убедитесь, что пользователь не заблокирован в домене
uk: Помилка: облікові дані користувача були відкликані - переконайтеся, що користувач не заблокований у домені

source: Authentication failed: make sure old password is correct
ru: Ошибка аутентификации: убедитесь, что старый пароль введён верно
uk: Помилка аутентифікації: переконайтеся, що старий пароль вірний

source: Password change rejected. This could have happened due to its too frequent change or its inconsistency with domain security policies
ru: Изменение пароля отклонено. Это могло произойти по причине слишком частой его смены либо его несоответствия политикам безопасности домена
uk: Зміна пароля відхилена. Це могло статися через занадто часту зміну або невідповідність політиці безпеки домену

source: Unknown error: {err_msg} ({err_code})
ru: Неизвестная ошибка: {err_msg} ({err_code})
uk: Невідома помилка: {err_msg} ({err_code})

source: Password changed successfully for user {username}
ru: Пароль успешно изменён для пользователя {username}
uk: Пароль успішно змінено для користувача {username}

source: The password was successfully changed
ru: Пароль успешно изменён
uk: Пароль було успішно змінено

source: The password was not changed for an unknown reason for the user {username}
ru: Пароль не был изменён по неизвестной причине для пользователя {username}
uk: Пароль не було змінено з невідомої причини для користувача {username}

source: Error: the password was not changed for an unknown reason — contact your administrator
ru: Ошибка: пароль не был изменён по неизвестной причине — обратитесь к администратору
uk: Помилка: пароль не було змінено з невідомої причини - зверніться до свого адміністратора

source: Username
ru: Имя пользователя
uk: Ім'я користувача

source: Old password
ru: Старый пароль
uk: Останній пароль

source: New password
ru: Новый пароль
uk: Новий пароль

source: Confirm new password
ru: Новый пароль ещё раз
uk: Новий пароль ще раз

source: Update password
ru: Изменить пароль
uk: Змінити пароль
